# Напишите программу, которая будет преобразовывать десятичное число в двоичное.

x = int(input("Введите число: "))
print(bin(x))
