# Вычислить число Пи c заданной точностью d

import math
d = int(input("Сколько знаков после запятой: "))
print(round(math.pi, d))
