# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.
r = [1, 3, 5, 3, 5, 3, 1]
print(set(r))
